{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Namaskar",
                "Hello",
                "Namaste",
                "Hey",
                "Hello",
                "I need help"
            ],
            "responses": [
                "Hey there",
                "How can I help you?",
                "Namaste"
            ]
        },
        {
            "tag": "departure",
            "patterns":["Bye", "Goodbye", "Quit", "See You Later"],
            "responses":[
                "See You Later",
                "Thanks for visiting",
                "Have a nice day!"
            ]
        },
        {
            "tag":"gratitude",
            "patterns":["Thanks", "You were helpful"],
            "responses":["Happy too help!", "Anytime!", "It's been a pleasure"]
        },
        {
            "tag":"humour",
            "patterns":[
                "Tell me a joke",
                "Humour me",
                "Say something funny"
            ],
            "responses":[
                "An apple a day keeps me inactive for a day",
                "This is a medical chatbot. Don't expect me to crack jokes"
            ]
        },
        {
            "tag":"disease_info_DrugReaction",
            "patterns":[
                "Please tell me about Drug Reaction",
                "What is Drug Reaction?",
                "Explain Drug Reaction"
            ],
            "responses":[
                "An adverse drug reaction (ADR) is an injury caused by taking medication. ADRs may occur following a single dose or prolonged administration of a drug or result from the combination of two or more drugs."
            ]
        }
        {
            "tag": "disease_info_Diabetes",
            "patterns": [
                "Please tell me about diabetes",
                "What is diabetes?",
                "Explain diabetes"
            ],
            "responses": [
                "Diabetes is a chronic medical condition that affects how your body processes glucose, a type of sugar. There are two main types of diabetes: Type 1 and Type 2. Type 1 diabetes is an autoimmune disease in which the body's immune system attacks and destroys the insulin-producing cells in the pancreas. Type 2 diabetes is characterized by insulin resistance, where the body's cells do not respond effectively to insulin. Both types of diabetes can lead to high blood sugar levels, which, if not managed, can cause serious health complications. Treatment for diabetes may include medication, insulin therapy, dietary changes, and regular exercise."
            ]
        },
        {
            "tag": "disease_info_Hypertension",
            "patterns": [
                "Please tell me about hypertension",
                "What is hypertension?",
                "Explain hypertension"
            ],
            "responses": [
                "Hypertension, also known as high blood pressure, is a medical condition in which the force of blood against the walls of the arteries is consistently too high. This can lead to various health problems, including heart disease, stroke, and kidney damage. Hypertension is often referred to as the 'silent killer' because it usually has no noticeable symptoms until it causes complications. Treatment for hypertension typically involves lifestyle changes such as a healthy diet, regular exercise, and medication prescribed by a healthcare provider."
            ]
        },
        {
            "tag": "disease_info_Asthma",
            "patterns": [
                "Please tell me about asthma",
                "What is asthma?",
                "Explain asthma"
            ],
            "responses": [
                "Asthma is a chronic respiratory condition that causes the airways in the lungs to become inflamed and narrowed. This leads to difficulty in breathing, wheezing, coughing, and chest tightness. Asthma symptoms can vary in severity and may be triggered by allergens, respiratory infections, exercise, or other factors. Treatment for asthma typically includes medications such as bronchodilators and inhaled corticosteroids, as well as avoidance of triggers and lifestyle modifications."
            ]
        },
        {
            "tag": "disease_info_Coronavirus",
            "patterns": [
                "Please tell me about coronavirus",
                "What is coronavirus?",
                "Explain coronavirus"
            ],
            "responses": [
                "Coronavirus disease 2019 (COVID-19) is a highly contagious respiratory illness caused by the novel coronavirus SARS-CoV-2. It first emerged in late 2019 and has since become a global pandemic. COVID-19 can range from mild to severe symptoms, with severe cases often leading to respiratory distress and other complications. Preventative measures include vaccination, mask-wearing, social distancing, and good hand hygiene. Treatment for COVID-19 varies depending on the severity of symptoms and may include supportive care, antiviral medications, and hospitalization in severe cases."
            ]
        },
        {
            "tag": "disease_info_Alzheimer's",
            "patterns": [
                "Please tell me about Alzheimer's disease",
                "What is Alzheimer's?",
                "Explain Alzheimer's"
            ],
            "responses": [
                "Alzheimer's disease is a progressive neurological disorder that primarily affects memory, thinking, and behavior. It is the most common cause of dementia in older adults. Alzheimer's is characterized by the accumulation of abnormal protein deposits in the brain and the loss of brain cells over time. Early symptoms may include forgetfulness and difficulty with language, but as the disease progresses, individuals may experience severe cognitive decline. Currently, there is no cure for Alzheimer's, but there are medications and interventions that can help manage symptoms and slow down the progression of the disease."
            ]
        },
        {
            "tag": "disease_info_Osteoporosis",
            "patterns": [
                "Please tell me about osteoporosis",
                "What is osteoporosis?",
                "Explain osteoporosis"
            ],
            "responses": [
                "Osteoporosis is a medical condition characterized by the weakening of bones, making them fragile and more susceptible to fractures. It is often referred to as the 'silent disease' because it can progress without any noticeable symptoms until a fracture occurs. Osteoporosis is more common in older adults, particularly postmenopausal women, but it can affect anyone. Treatment for osteoporosis involves medications to strengthen bones, dietary changes to increase calcium and vitamin D intake, and weight-bearing exercises to improve bone density."
            ]
        },
        {
            "tag": "disease_info_Migraine",
            "patterns": [
                "Please tell me about migraines",
                "What are migraines?",
                "Explain migraines"
            ],
            "responses": [
                "Migraines are a type of recurring headache characterized by intense and throbbing pain, often on one side of the head. Migraines are usually accompanied by other symptoms such as nausea, vomiting, and sensitivity to light and sound. They can be triggered by various factors, including certain foods, stress, hormonal changes, and environmental factors. Treatment for migraines may include medications to relieve pain and prevent future attacks, as well as lifestyle modifications to identify and avoid triggers."
            ]
        },
        {
            "tag": "disease_info_Depression",
            "patterns": [
                "Please tell me about depression",
                "What is depression?",
                "Explain depression"
            ],
            "responses": [
                "Depression is a mood disorder characterized by persistent feelings of sadness, hopelessness, and a lack of interest or pleasure in activities. It can affect a person's thoughts, feelings, and behavior and can lead to physical symptoms such as changes in appetite and sleep patterns. Depression can vary in severity and duration. Treatment for depression may include psychotherapy, medications, lifestyle changes, and support from mental health professionals."
            ]
        },
        {
            "tag": "disease_info_Cancer",
            "patterns": [
                "Please tell me about cancer",
                "What is cancer?",
                "Explain cancer"
            ],
            "responses": [
                "Cancer is a group of diseases characterized by the uncontrolled growth and spread of abnormal cells in the body. There are many types of cancer, each with its own set of symptoms and treatments. Common types of cancer include breast cancer, lung cancer, prostate cancer, and colorectal cancer. Cancer treatment options may include surgery, chemotherapy, radiation therapy, immunotherapy, and targeted therapy, depending on the type and stage of cancer."
            ]
        },
        {
            "tag": "disease_info_Stroke",
            "patterns": [
                "Please tell me about strokes",
                "What is a stroke?",
                "Explain strokes"
            ],
            "responses": [
                "A stroke, also known as a cerebrovascular accident (CVA), is a medical emergency that occurs when there is a disruption of blood flow to the brain. Strokes can be ischemic (caused by a blood clot blocking an artery) or hemorrhagic (caused by a ruptured blood vessel in the brain). Symptoms of a stroke may include"
]
},
        {
            "tag": "disease_info_Parkinson's",
            "patterns": [
                "Please tell me about Parkinson's disease",
                "What is Parkinson's?",
                "Explain Parkinson's"
            ],
            "responses": [
                "Parkinson's disease is a progressive neurological disorder that affects movement. It is characterized by tremors, stiffness, slow movements, and difficulty with balance and coordination. Parkinson's disease results from the loss of dopamine-producing cells in the brain. While there is no cure, medications and therapies can help manage the symptoms and improve the quality of life for individuals with Parkinson's disease."
            ]
        },
        {
            "tag": "disease_info_COPD",
            "patterns": [
                "Please tell me about COPD",
                "What is COPD?",
                "Explain COPD"
            ],
            "responses": [
                "Chronic Obstructive Pulmonary Disease (COPD) is a progressive lung disease that makes it difficult to breathe. It encompasses conditions such as chronic bronchitis and emphysema. COPD is often caused by long-term exposure to irritants like cigarette smoke or air pollution. Symptoms include coughing, wheezing, shortness of breath, and chest tightness. Treatment includes bronchodilator medications, inhaled steroids, and lifestyle changes."
            ]
        },
        {
            "tag": "disease_info_Rheumatoid_Arthritis",
            "patterns": [
                "Please tell me about Rheumatoid Arthritis",
                "What is Rheumatoid Arthritis?",
                "Explain Rheumatoid Arthritis"
            ],
            "responses": [
                "Rheumatoid arthritis (RA) is an autoimmune disease that primarily affects the joints. It causes inflammation, pain, and swelling in the joints, leading to joint damage over time. RA can also affect other parts of the body. Treatment includes disease-modifying antirheumatic drugs (DMARDs), pain relievers, physical therapy, and lifestyle modifications."
            ]
        },
        {
            "tag": "disease_info_Lupus",
            "patterns": [
                "Please tell me about Lupus",
                "What is Lupus?",
                "Explain Lupus"
            ],
            "responses": [
                "Lupus, or systemic lupus erythematosus (SLE), is an autoimmune disease that can affect various parts of the body, including the skin, joints, and organs. It often presents with symptoms such as joint pain, skin rashes, fatigue, and fever. Treatment includes medications to manage symptoms and control the immune system's response."
            ]
        },
        {
            "tag": "disease_info_Epilepsy",
            "patterns": [
                "Please tell me about Epilepsy",
                "What is Epilepsy?",
                "Explain Epilepsy"
            ],
            "responses": [
                "Epilepsy is a neurological disorder characterized by recurrent seizures, which can vary in type and severity. Seizures are caused by abnormal electrical activity in the brain. Treatment includes antiepileptic medications, lifestyle adjustments, and, in some cases, surgery."
            ]
        },
        {
            "tag": "disease_info_Multiple_Sclerosis",
            "patterns": [
                "Please tell me about Multiple Sclerosis",
                "What is Multiple Sclerosis?",
                "Explain Multiple Sclerosis"
            ],
            "responses": [
                "Multiple sclerosis (MS) is a chronic autoimmune disease that affects the central nervous system. It can lead to a wide range of symptoms, including fatigue, muscle weakness, numbness or tingling, and difficulty with coordination. Treatment aims to manage symptoms and slow the progression of the disease and may include disease-modifying medications, physical therapy, and lifestyle changes."
            ]
        },
        {
            "tag": "disease_info_Ovarian_Cancer",
            "patterns": [
                "Please tell me about Ovarian Cancer",
                "What is Ovarian Cancer?",
                "Explain Ovarian Cancer"
            ],
            "responses": [
                "Ovarian cancer is a type of cancer that begins in the ovaries. It often goes undetected until it has spread to other parts of the body. Symptoms may include abdominal pain, bloating, and changes in urinary or bowel habits. Treatment usually involves surgery and chemotherapy."
            ]
        },
        {
            "tag": "disease_info_Celiac_Disease",
            "patterns": [
                "Please tell me about Celiac Disease",
                "What is Celiac Disease?",
                "Explain Celiac Disease"
            ],
            "responses": [
                "Celiac disease is an autoimmune disorder triggered by the consumption of gluten, a protein found in wheat, barley, and rye. It damages the lining of the small intestine and impairs nutrient absorption. Symptoms include digestive issues, fatigue, and skin rashes. Treatment involves a gluten-free diet."
            ]
        },
        {
            "tag": "disease_info_Hepatitis_B",
            "patterns": [
                "Please tell me about Hepatitis B",
                "What is Hepatitis B?",
                "Explain Hepatitis B"
            ],
            "responses": [
                "Hepatitis B is a viral infection that affects the liver. It can lead to both acute and chronic liver disease and increase the risk of liver cancer. Symptoms may include jaundice, fatigue, and abdominal pain. Vaccination is available for prevention, and treatment includes antiviral medications."
            ]
        },
        {
            "tag": "disease_info_Liver_Cirrhosis",
            "patterns": [
                "Please tell me about Liver Cirrhosis",
                "What is Liver Cirrhosis?",
                "Explain Liver Cirrhosis"
            ],
            "responses": [
                "Liver cirrhosis is a late stage of scarring of the liver caused by long-term liver damage. It can result from various causes, including chronic alcohol use and viral hepatitis. Symptoms may include fatigue, jaundice, and abdominal pain. Treatment aims to manage complications and may involve lifestyle changes and medications."
            ]
        },
        {
            "tag": "disease_info_Psoriasis",
            "patterns": [
                "Please tell me about Psoriasis",
                "What is Psoriasis?",
                "Explain Psoriasis"
            ],
            "responses": [
                "Psoriasis is a chronic skin condition that causes cells to build up rapidly on the surface of the skin, leading to red, itchy, and scaly patches. It is an autoimmune disease that can also affect the joints (psoriatic arthritis). Treatment includes topical medications, phototherapy, and systemic medications."
            ]
        },
        {
            "tag": "disease_info_Glaucoma",
            "patterns": [
                "Please tell me about Glaucoma",
                "What is Glaucoma?",
                "Explain Glaucoma"
            ],
            "responses": [
                "Glaucoma is a group of eye conditions that can damage the optic nerve, leading to vision loss and blindness. It is often associated with increased intraocular pressure. Glaucoma may not cause symptoms until it's advanced. Treatment includes medications, laser therapy, and surgery to lower eye pressure."
            ]
        },
        
        {
            "tag": "disease_info_Osteoarthritis",
            "patterns": [
                "Please tell me about Osteoarthritis",
                "What is Osteoarthritis?",
                "Explain Osteoarthritis"
            ],
            "responses": [
                "Osteoarthritis is a degenerative joint disease that affects the cartilage in your joints. It can cause joint pain and stiffness, especially in the knees, hips, and hands. Over time, the cartilage can wear away, leading to bone-on-bone contact. Treatment includes pain management, physical therapy, and in some cases, joint replacement surgery."
            ]
        },
        {
            "tag": "disease_info_Crohn's_Disease",
            "patterns": [
                "Please tell me about Crohn's Disease",
                "What is Crohn's Disease?",
                "Explain Crohn's Disease"
            ],
            "responses": [
                "Crohn's disease is a chronic inflammatory bowel disease that can affect any part of the digestive tract. It often leads to abdominal pain, diarrhea, fatigue, and weight loss. The exact cause is unknown, but it involves an abnormal immune response. Treatment includes medications to reduce inflammation, manage symptoms, and, in some cases, surgery to remove damaged portions of the intestine."
            ]
        },
        {
            "tag": "disease_info_Schizophrenia",
            "patterns": [
                "Please tell me about Schizophrenia",
                "What is Schizophrenia?",
                "Explain Schizophrenia"
            ],
            "responses": [
                "Schizophrenia is a severe mental disorder characterized by distorted thinking, hallucinations, delusions, and impaired social functioning. It usually emerges in late adolescence or early adulthood. The exact cause is unclear, but genetics and environmental factors may play a role. Treatment involves antipsychotic medications, psychotherapy, and support services."
            ]
        },
        {
            "tag": "disease_info_Rosacea",
            "patterns": [
                "Please tell me about Rosacea",
                "What is Rosacea?",
                "Explain Rosacea"
            ],
            "responses": [
                "Rosacea is a chronic skin condition that causes redness, visible blood vessels, and pimple-like bumps on the face. It can also affect the eyes (ocular rosacea). The exact cause is unknown, but factors like genetics and environmental triggers may contribute. Treatment includes topical and oral medications, as well as lifestyle changes to manage triggers."
            ]
        },
        {
            "tag": "disease_info_Bipolar_Disorder",
            "patterns": [
                "Please tell me about Bipolar Disorder",
                "What is Bipolar Disorder?",
                "Explain Bipolar Disorder"
            ],
            "responses": [
                "Bipolar disorder is a mental health condition characterized by extreme mood swings, including manic episodes (highs) and depressive episodes (lows). It can disrupt daily life and affect relationships. The exact cause is complex, involving genetic and environmental factors. Treatment includes mood-stabilizing medications and psychotherapy."
            ]
        },
        {
            "tag": "disease_info_Endometriosis",
            "patterns": [
                "Please tell me about Endometriosis",
                "What is Endometriosis?",
                "Explain Endometriosis"
            ],
            "responses": [
                "Endometriosis is a painful disorder in which tissue similar to the lining of the uterus (endometrium) grows outside the uterus. It can cause pelvic pain, heavy periods, and fertility problems. The exact cause is not fully understood. Treatment may involve pain relief medications, hormone therapy, and surgery to remove the abnormal tissue."
            ]
        },
        {
            "tag": "disease_info_Psoriatic_Arthritis",
            "patterns": [
                "Please tell me about Psoriatic Arthritis",
                "What is Psoriatic Arthritis?",
                "Explain Psoriatic Arthritis"
            ],
            "responses": [
                "Psoriatic arthritis is a type of inflammatory arthritis that affects some people with psoriasis, a skin condition. It can cause joint pain, stiffness, and swelling, along with skin symptoms. The exact cause is unclear but likely involves genetic and immune system factors. Treatment includes medications to reduce inflammation, physical therapy, and lifestyle changes."
            ]
        },
        {
            "tag": "disease_info_Anorexia_Nervosa",
            "patterns": [
                "Please tell me about Anorexia Nervosa",
                "What is Anorexia Nervosa?",
                "Explain Anorexia Nervosa"
            ],
            "responses": [
                "Anorexia nervosa is an eating disorder characterized by an intense fear of gaining weight and a distorted body image. It often leads to severe weight loss and malnutrition. The exact cause is complex and may involve genetic, psychological, and societal factors. Treatment involves medical and psychological interventions, including therapy and nutritional support."
            ]
        },
        {
            "tag": "disease_info_Melanoma",
            "patterns": [
                "Please tell me about Melanoma",
                "What is Melanoma?",
                "Explain Melanoma"
            ],
            "responses": [
                "Melanoma is a type of skin cancer that begins in melanocytes, the cells that produce pigment in the skin. It can appear as moles or abnormal skin growths. UV exposure is a significant risk factor. Treatment includes surgical removal, immunotherapy, targeted therapy, and radiation therapy, depending on the stage and location of the melanoma."
            ]
        },
        {
            "tag": "disease_info_Parkinson's",
            "patterns": [
                "Please tell me about Parkinson's disease",
                "What is Parkinson's?",
                "Explain Parkinson's"
            ],
            "responses": [
                "Parkinson's disease is a progressive neurological disorder that primarily affects movement. It is characterized by tremors, stiffness, slow movements, and difficulty with balance and coordination. Parkinson's disease results from the loss of dopamine-producing cells in the brain. While there is no cure, medications and therapies can help manage the symptoms and improve the quality of life for individuals with Parkinson's disease."
            ]
        },
        
        {
            "tag": "disease_info_Ebola",
            "patterns": [
                "Please tell me about Ebola",
                "What is Ebola?",
                "Explain Ebola"
            ],
            "responses": [
                "Ebola virus disease (EVD) is a severe and often fatal illness caused by the Ebola virus. It can lead to symptoms such as fever, fatigue, muscle pain, and hemorrhagic fever. Ebola is transmitted through direct contact with the blood, secretions, or organs of infected animals or humans. Treatment involves supportive care, including fluid replacement and symptom management."
            ]
        },
        {
            "tag": "disease_info_Hemophilia",
            "patterns": [
                "Please tell me about Hemophilia",
                "What is Hemophilia?",
                "Explain Hemophilia"
            ],
            "responses": [
                "Hemophilia is a rare genetic disorder that impairs the blood's ability to clot properly. People with hemophilia may experience prolonged bleeding after injuries or surgeries. There are different types of hemophilia (e.g., hemophilia A, hemophilia B), and treatment involves clotting factor replacement therapy to prevent or control bleeding episodes."
            ]
        },
        {
            "tag": "disease_info_Lupus",
            "patterns": [
                "Please tell me about Lupus",
                "What is Lupus?",
                "Explain Lupus"
            ],
            "responses": [
                "Lupus, or systemic lupus erythematosus (SLE), is an autoimmune disease that can affect various parts of the body, including the skin, joints, and organs. It often presents with symptoms such as joint pain, skin rashes, fatigue, and fever. Treatment includes medications to manage symptoms and control the immune system's response."
            ]
        },
        {
            "tag": "disease_info_Sickle_Cell_Anemia",
            "patterns": [
                "Please tell me about Sickle Cell Anemia",
                "What is Sickle Cell Anemia?",
                "Explain Sickle Cell Anemia"
            ],
            "responses": [
                "Sickle Cell Anemia is an inherited blood disorder characterized by abnormal hemoglobin, which causes red blood cells to become misshapen and break down. This leads to anemia and pain episodes called crises. It primarily affects people of African, Mediterranean, and Middle Eastern descent. Treatment includes pain management, blood transfusions, and medications to reduce complications."
            ]
        },
        {
            "tag": "disease_info_Tuberculosis",
            "patterns": [
                "Please tell me about Tuberculosis",
                "What is Tuberculosis?",
                "Explain Tuberculosis"
            ],
            "responses": [
                "Tuberculosis (TB) is a bacterial infection caused by Mycobacterium tuberculosis. It primarily affects the lungs but can also impact other organs. Symptoms may include persistent cough, fever, and weight loss. TB is contagious and spreads through the air when an infected person coughs or sneezes. Treatment involves antibiotics taken for several months to kill the bacteria."
            ]
        },
        {
            "tag": "disease_info_Huntington's_Disease",
            "patterns": [
                "Please tell me about Huntington's Disease",
                "What is Huntington's Disease?",
                "Explain Huntington's Disease"
            ],
            "responses": [
                "Huntington's Disease is a hereditary neurodegenerative disorder that affects movement, cognition, and behavior. It is caused by a mutation in the HTT gene. Symptoms often appear in mid-adulthood and worsen over time. They may include involuntary movements (chorea), mood changes, and cognitive decline. While there is no cure, treatment focuses on managing symptoms and providing support through medications and therapy."
            ]
        },
        {
            "tag": "disease_info_Lyme_Disease",
            "patterns": [
                "Please tell me about Lyme Disease",
                "What is Lyme Disease?",
                "Explain Lyme Disease"
            ],
            "responses": [
                "Lyme Disease is an infectious disease caused by the bacterium Borrelia burgdorferi and transmitted through the bite of infected ticks. It can lead to symptoms such as fever, fatigue, joint pain, and a characteristic skin rash called erythema migrans. Early treatment with antibiotics is effective, but if left untreated, Lyme Disease can lead to more severe symptoms affecting the joints, heart, and nervous system."
            ]
        }
    ]
}
